; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v4 ?v12)
             (pred_2 ?v11 ?v5)
             (pred_12 ?v4 ?v5)
             (pred_8 ?v7 ?v4 )
	     (pred_4 ?v4)
             (pred_7 ?v13)
             (pred_1 ?v11)
             (pred_3 ?v5)
             (pred_5 ?v4)
             (pred_6 ?v11)
             (pred_9 ?v4)
             (pred_10 ))



(:action op_2
:parameters (?v10 ?v8 ?v6 ?v2)
:precondition (and (pred_7 ?v10) (pred_7 ?v8) (pred_1 ?v6) (pred_3 ?v2)
          (pred_11 ?v10 ?v8) (pred_2 ?v6 ?v2)
                   (pred_12 ?v8 ?v2) (pred_4 ?v10) 
                   (pred_5 ?v8) (pred_6 ?v6))
:effect (and  (pred_9 ?v8) (not (pred_5 ?v8))))


(:action op_1
:parameters (?v10 ?v1)
:precondition (and (pred_7 ?v10) (pred_7 ?v1)
               (pred_4 ?v10) (pred_11 ?v10 ?v1) (pred_9 ?v1))
:effect (and (pred_4 ?v1) (not (pred_4 ?v10))))

(:action op_5
:parameters (?v10 ?v6)
:precondition (and (pred_7 ?v10) (pred_1 ?v6) 
                  (pred_4 ?v10) (pred_8 ?v6 ?v10) (pred_10 ))
:effect (and (pred_6 ?v6)
   (not (pred_8 ?v6 ?v10)) (not (pred_10 ))))


(:action op_4
:parameters (?v10 ?v9 ?v3)
:precondition (and (pred_7 ?v10) (pred_1 ?v9) (pred_1 ?v3)
                  (pred_4 ?v10) (pred_6 ?v3) (pred_8 ?v9 ?v10))
:effect (and (pred_6 ?v9) (pred_8 ?v3 ?v10)
        (not (pred_6 ?v3)) (not (pred_8 ?v9 ?v10))))

(:action op_3
:parameters (?v10 ?v6)
:precondition (and (pred_7 ?v10) (pred_1 ?v6) 
                  (pred_4 ?v10) (pred_6 ?v6))
:effect (and (pred_10 ) (pred_8 ?v6 ?v10) (not (pred_6 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_06 obj_19 obj_17 obj_21 obj_10 obj_13 obj_03 obj_08 obj_01 obj_11 obj_04 obj_20 obj_02 obj_07 obj_05
    obj_18 obj_09
    obj_15 obj_12 obj_14
    )

    (:init
       (pred_10)

       (pred_7 obj_16)
       (pred_7 obj_06)
       (pred_7 obj_19)
       (pred_7 obj_17)
       (pred_7 obj_21)
       (pred_7 obj_10)
       (pred_7 obj_13)
       (pred_7 obj_03)
       (pred_7 obj_08)
       (pred_7 obj_01)
       (pred_7 obj_11)
       (pred_7 obj_04)
       (pred_7 obj_20)
       (pred_7 obj_02)
       (pred_7 obj_07)
       (pred_7 obj_05)
       (pred_3 obj_18)
       (pred_3 obj_09)
       (pred_1 obj_15)
       (pred_1 obj_12)
       (pred_1 obj_14)

       (pred_11 obj_16 obj_21)
       (pred_11 obj_16 obj_06)
       (pred_11 obj_06 obj_10)
       (pred_11 obj_06 obj_19)
       (pred_11 obj_06 obj_16)
       (pred_11 obj_19 obj_13)
       (pred_11 obj_19 obj_17)
       (pred_11 obj_19 obj_06)
       (pred_11 obj_17 obj_03)
       (pred_11 obj_17 obj_19)
       (pred_11 obj_21 obj_08)
       (pred_11 obj_21 obj_10)
       (pred_11 obj_21 obj_16)
       (pred_11 obj_10 obj_01)
       (pred_11 obj_10 obj_13)
       (pred_11 obj_10 obj_06)
       (pred_11 obj_10 obj_21)
       (pred_11 obj_13 obj_11)
       (pred_11 obj_13 obj_03)
       (pred_11 obj_13 obj_19)
       (pred_11 obj_13 obj_10)
       (pred_11 obj_03 obj_04)
       (pred_11 obj_03 obj_17)
       (pred_11 obj_03 obj_13)
       (pred_11 obj_08 obj_20)
       (pred_11 obj_08 obj_01)
       (pred_11 obj_08 obj_21)
       (pred_11 obj_01 obj_02)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_01 obj_10)
       (pred_11 obj_01 obj_08)
       (pred_11 obj_11 obj_07)
       (pred_11 obj_11 obj_04)
       (pred_11 obj_11 obj_13)
       (pred_11 obj_11 obj_01)
       (pred_11 obj_04 obj_05)
       (pred_11 obj_04 obj_03)
       (pred_11 obj_04 obj_11)
       (pred_11 obj_20 obj_02)
       (pred_11 obj_20 obj_08)
       (pred_11 obj_02 obj_07)
       (pred_11 obj_02 obj_01)
       (pred_11 obj_02 obj_20)
       (pred_11 obj_07 obj_05)
       (pred_11 obj_07 obj_11)
       (pred_11 obj_07 obj_02)
       (pred_11 obj_05 obj_04)
       (pred_11 obj_05 obj_07)
       (pred_5 obj_21)
       (pred_5 obj_20)
       (pred_5 obj_16)
       (pred_12  obj_21 obj_18)
       (pred_12  obj_20 obj_09)
       (pred_12  obj_16 obj_18)
       (pred_9 obj_06)
       (pred_9 obj_19)
       (pred_9 obj_17)
       (pred_9 obj_10)
       (pred_9 obj_13)
       (pred_9 obj_03)
       (pred_9 obj_08)
       (pred_9 obj_01)
       (pred_9 obj_11)
       (pred_9 obj_04)
       (pred_9 obj_02)
       (pred_9 obj_07)
       (pred_9 obj_05)

       (pred_2  obj_15 obj_18)
       (pred_2  obj_12 obj_09)
       (pred_2  obj_14 obj_09)
       (pred_8 obj_15 obj_04)
       (pred_8 obj_12 obj_10)
       (pred_8 obj_14 obj_01)
       (pred_4 obj_10)
    )

    (:goal (and
       (pred_8 obj_15 obj_01)
    ))
(:constraints
  (always (not (pred_4 obj_11)))
)
)

; plan
1. (op_1 obj_10 obj_13)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_13)
   goals met: 0 of 1
2. (op_1 obj_13 obj_03)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_03)
   goals met: 0 of 1
3. (op_1 obj_03 obj_04)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_04)
   goals met: 0 of 1
4. (op_5 obj_04 obj_15)
   deleted: (pred_8 obj_15 obj_04) (pred_10)
   added: (pred_6 obj_15)
   goals met: 0 of 1
5. (op_1 obj_04 obj_03)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_03)
   goals met: 0 of 1
6. (op_1 obj_03 obj_13)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_13)
   goals met: 0 of 1
7. (op_1 obj_13 obj_10)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_10)
   goals met: 0 of 1
8. (op_1 obj_10 obj_01)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_01)
   goals met: 0 of 1
9. (op_4 obj_01 obj_14 obj_15)
   deleted: (pred_6 obj_15) (pred_8 obj_14 obj_01)
   added: (pred_6 obj_14) (pred_8 obj_15 obj_01)
   goals met: 1 of 1
